kiranbad/STM32F407/UART_INTERRUPT/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2026 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */


#include <stdint.h>
#include "stm32f407xx.h"
#include <string.h>

// Handle and Buffers
USART_Handle_t usart2_handle;
char msg[] = "Hello\r\n";
char done_msg[] = "Transmission Done\r\n";
char live_status_buffer[32]; // View this in Live Expression

void USART2_GPIOInit(void)
{
    GPIO_Handle_t usart_gpios;

    // 1. Enable Clock for GPIOA
    GPIO_PeriClockControl(GPIOA, ENABLE);

    usart_gpios.pGPIOx = GPIOA;
    usart_gpios.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_ALTFN;
    usart_gpios.GPIO_PinConfig.GPIO_PinOPtype = GPIO_OP_TYPE_PP;
    usart_gpios.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_PIN_PU;
    usart_gpios.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
    usart_gpios.GPIO_PinConfig.GPIO_PinAltFunMode = 7;

    // USART2 TX (PA2)
    usart_gpios.GPIO_PinConfig.GPIO_PinNumber  = GPIO_PIN_NO_2;
    GPIO_Init(&usart_gpios);

    // USART2 RX (PA3)
    usart_gpios.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_3;
    GPIO_Init(&usart_gpios);
}

void USART2_Init(void)
{
    // 2. Enable Clock for USART2
    USART_PeriClockControl(USART2, ENABLE);

    usart2_handle.pUSARTx = USART2;
    usart2_handle.USART_Config.USART_Baud = USART_STD_BAUD_115200;
    usart2_handle.USART_Config.USART_HWFlowControl = USART_HW_FLOW_CTRL_NONE;
    usart2_handle.USART_Config.USART_Mode = USART_MODE_TXRX;
    usart2_handle.USART_Config.USART_NoOfStopBits = USART_STOPBITS_1;
    usart2_handle.USART_Config.USART_WordLength = USART_WORDLEN_8BITS;
    usart2_handle.USART_Config.USART_ParityControl = USART_PARITY_DISABLE;
    USART_Init(&usart2_handle);
}

void GPIO_ButtonInit(void)
{
    GPIO_Handle_t GPIOBtn, GpioLed;

    // Enable Clock for Port A and D
    GPIO_PeriClockControl(GPIOA, ENABLE);
    GPIO_PeriClockControl(GPIOD, ENABLE);

    // Button (PA0)
    GPIOBtn.pGPIOx = GPIOA;
    GPIOBtn.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_0;
    GPIOBtn.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_IN;
    GPIOBtn.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
    GPIOBtn.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
    GPIO_Init(&GPIOBtn);

    // LED (PD12)
    GpioLed.pGPIOx = GPIOD;
    GpioLed.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_12;
    GpioLed.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
    GpioLed.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
    GpioLed.GPIO_PinConfig.GPIO_PinOPtype = GPIO_OP_TYPE_PP;
    GpioLed.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
    GPIO_Init(&GpioLed);
}

void delay(void)
{
    for(uint32_t i = 0; i < 500000/2; i++);
}

int main()
{
    // Initial Setup
    GPIO_ButtonInit();
    USART2_GPIOInit();
    USART2_Init();

    // Configure NVIC for USART2
    USART_IRQInterruptConfig(IRQ_NO_USART2, ENABLE);

    // Enable Peripheral
    USART_PeripheralControl(USART2, ENABLE);

    // Ensure status buffer is clean at start
    memset(live_status_buffer, 0, sizeof(live_status_buffer));

    while(1)
    {
        // Wait for button press
        while(!GPIO_ReadFromInputPin(GPIOA, GPIO_PIN_NO_0));

        // Debounce
        delay();

        // Clear LED and status buffer for the new transmission
        GPIO_WriteToOutputPin(GPIOD, GPIO_PIN_NO_12, RESET);
        delay();
        memset(live_status_buffer, 0, sizeof(live_status_buffer));

        // Start Transmission using Interrupts//inside this function TXEIE will be 1 so interrupt occurs.
        USART_SendDataIT(&usart2_handle, (uint8_t*)msg, strlen(msg));

        // Wait for button release to avoid multiple triggers
        while(GPIO_ReadFromInputPin(GPIOA, GPIO_PIN_NO_0));
    }
}

void USART2_IRQHandler(void)
{
    USART_IRQHandling(&usart2_handle);
}

void USART_ApplicationEventCallback(USART_Handle_t *pUSARTHandle, uint8_t AppEv)
{
    if(AppEv == USART_EVENT_TX_CMPLT)
    {
        // 1. Blink LED to signal completion
        GPIO_WriteToOutputPin(GPIOD, GPIO_PIN_NO_12, SET);

        // 2. Store completion message in the live expression buffer
        strcpy(live_status_buffer, done_msg);

        // 3. (Optional) Also send it to the terminal
        USART_SendData(pUSARTHandle, (uint8_t*)done_msg, strlen(done_msg));
    }
}
